Autodesk.Revit.DB.Electrical.CircuitNamingScheme.Create(Autodesk.Revit.DB.Document,System.String,System.Collections.Generic.IList{Autodesk.Revit.DB.TableCellCombinedParameterData})
Creates a new CircuitNamingScheme.
document:
The document in which to create the CircuitNamingScheme.
name:
The name of CircuitNamingScheme.
data:
The array of TableCellCombinedParameterData to be set as combined parameters.
Returns:
The newly created CircuitNamingScheme.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string or contains only whitespace.
-or-
name cannot include prohibited characters.
-or-
The given value for name is already in use as a CircuitNamingScheme name.
-or-
The data contains invalid parameter id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2021